{"review": "He is one of the worst professor in my NJIT career, He does not do anything and He expects from students to do everything. His slides are 10 years old and His approach towards teaching student is literally boring and there is nothing that he does in class to get students interested in one of the best industry right now (cloud computing)", "sentiment_score": -0.5, "sentiment_magnitude": 1.0, "quality": "1.0", "difficulty": "2.0"}
 {"review": "He teaches only theory and for practical implementation learn on your own. That's not how things work in Job Market. Also emphasis a lot on keywords. If you are good on mugging up words this professor is good for you otherwise it's a Red Flag.", "sentiment_score": 0.10000000149011612, "sentiment_magnitude": 1.5, "quality": "1.0", "difficulty": "3.0"}
 {"review": "Great professor. You will learn a lot. Great lectures. Crystal clear and straight to the point answers to student questions. But get ready for a lot of tough work. No free lunches.", "sentiment_score": 0.4000000059604645, "sentiment_magnitude": 4.400000095367432, "quality": "5.0", "difficulty": "4.0"}
 {"review": "Excellent and great professor, if you do not understand Networking, You will understand it very well.", "sentiment_score": 0.8999999761581421, "sentiment_magnitude": 0.8999999761581421, "quality": "5.0", "difficulty": "2.0"}
 {"review": "Great professor.", "sentiment_score": 0.800000011920929, "sentiment_magnitude": 0.800000011920929, "quality": "5.0", "difficulty": "1.0"}
 {"review": "Good Professor but A LOT of work. Ensure you have a solid undergrad foundation in networking because there will be no time to study it since most of your time will be spent on the programming assignments (they are tough and time consuming). Ensure you know Java (or C/C++ v well). Exams/Midterms are challenging. U will learn 656 very well.", "sentiment_score": 0.699999988079071, "sentiment_magnitude": 3.5, "quality": "3.5", "difficulty": "5.0"}
 {"review": "A wonderful teacher. He knows a lot, a very helpful person. He talks about real life problems and new things in networking. He has a good reputation in the research community also.", "sentiment_score": 0.699999988079071, "sentiment_magnitude": 2.799999952316284, "quality": "5.0", "difficulty": "2.0"}
 {"review": "Very intelligent, main focus is students understanding concepts and being to apply them correctly. Homework not mandatory but VERY useful to do! Programming project very difficult (esp with low programming exp) but great experience. NOT easy 'A', but will certainly learn and get lots out of the class. Real world concepts. Would/will take again.", "sentiment_score": 0.4000000059604645, "sentiment_magnitude": 3.4000000953674316, "quality": "5.0", "difficulty": "4.0"}
 {"review": "Great instructor. READ THE TEXT! Read the book before lecture, go over slides before the exam, and you'll be fine. He's more concerned that you learn the concepts, so not much math involved. Grades are curved at the end. The programming project is not easy, but worth it (I could say to employers I programmed a multi-threaded server).", "sentiment_score": 0.10000000149011612, "sentiment_magnitude": 1.7000000476837158, "quality": "4.5", "difficulty": "4.0"}
 {"review": "He is a good professor. he teaches excellent. we will really excel in networks. If u work hard then for sure we can get A. But the project would be difficult. So if u know programming u can take.", "sentiment_score": 0.4000000059604645, "sentiment_magnitude": 1.600000023841858, "quality": "4.5", "difficulty": "5.0"}
 {"review": "He is the best.He helps his students get the best of the subject.If we make any mistakes he will show us the right way like a father.Not like some professors at njit who try to fail students.He takes care of students.", "sentiment_score": 0.8999999761581421, "sentiment_magnitude": 0.8999999761581421, "quality": "5.0", "difficulty": "2.0"}
 {"review": "great teacher. he will make you work hard but you will absolutely learn something. will provide you with help if you need it.", "sentiment_score": 0.4000000059604645, "sentiment_magnitude": 0.8999999761581421, "quality": "4.5", "difficulty": "4.0"}
 {"review": "take this class only if ur good at programming...........", "sentiment_score": -0.10000000149011612, "sentiment_magnitude": 0.10000000149011612, "quality": "4.0", "difficulty": "5.0"}
 {"review": "He's a great teacher. I learned more in his class than in any other i have taken so far at NJIT. His lectures are interesting and he does answer your questions and queries. But he does absolutely detest slackers. So if you were to slack off work and go to him for help he will absolutely kick your butt out of his office ;D", "sentiment_score": 0.20000000298023224, "sentiment_magnitude": 3.200000047683716, "quality": "4.0", "difficulty": "4.0"}
 {"review": "If you want to work hard then take it.", "sentiment_score": -0.30000001192092896, "sentiment_magnitude": 0.30000001192092896, "quality": "3.0", "difficulty": "3.0"}
 {"review": "He is a wonderful teacher. If u hate networks, u start liking it after you attend his classes.. He is a wonderful teacher.. However, to be in his class one shud have good programming skills. Gives HW every week. Credits decided by the amount of work you put in. Proj will be very difficult..", "sentiment_score": 0.30000001192092896, "sentiment_magnitude": 3.5, "quality": "5.0", "difficulty": "4.0"}
 {"review": "Well he is an tough guy and expects a lot from us.He just reads from the slides and gives really tough projects which count a lot towards the grade.Infact he gives projects which r done at PHD level.Though his exams r not that tough he does not correct them properly.he is more specific on some answers ..My sincere advice is not to take under him.", "sentiment_score": -0.10000000149011612, "sentiment_magnitude": 0.10000000149011612, "quality": "1.5", "difficulty": "5.0"}
 {"review": "Just reads from slides. Exams are tough. He gave a pathetic project in which we were suppose to fill in code of some program. It was unreasonable and he didnt even bother to explain the whole concept of his project.", "sentiment_score": -0.30000001192092896, "sentiment_magnitude": 2.200000047683716, "quality": "2.0", "difficulty": "4.0"}
